app/controllers/trips_controller.rb

  def index
    @trips = current_user.trips.paginate(page: params[:page], per_page: 8)
---
SELECT  "trips".* FROM "trips" WHERE "trips"."user_id" = $1 LIMIT $2 OFFSET $3  [["user_id", 1], ["LIMIT", 8], ["OFFSET", 0]]
SELECT COUNT(*) FROM "trips" WHERE "trips"."user_id" = $1  [["user_id", 1]]

  def create
    @trip = current_user.trips.new(trip_params)
    if @trip.save
---
INSERT INTO "trips" ("trip_name", "duration", "budget", "people_going", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["trip_name", "salt "], ["duration", "lake "], ["budget", 345], ["people_going", 2], ["created_at", 2017-02-14 00:22:15 UTC], ["updated_at", 2017-02-14 00:22:15 UTC], ["user_id", 1]]

  def update
    if @trip.update(trip_params)
---
UPDATE "trips" SET "duration" = $1, "budget" = $2, "people_going" = $3, "updated_at" = $4 WHERE "trips"."id" = $5  [["duration", "lkjsdf"], ["budget", 343], ["people_going", 23], ["updated_at", 2017-02-10 19:23:32 UTC], ["id", 1]]

  def destroy
    @trip.destroy
---
DELETE FROM "trips" WHERE "trips"."id" = $1  [["id", 2]]